# SizeCount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Segment..::..SizeCount Property
Segment Class See Also
---
The number of size objects in the segment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int SizeCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SizeCount As Integer
	Get
```

Visual C++
---
```text
public:
property int SizeCount {
	int get ();
}
```

# See Also
Segment Class
Autodesk.Revit.DB Namespace